liji3597/CACRS-on-STM32F4/1.0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY0_Pin GPIO_PIN_8
#define KEY0_GPIO_Port GPIOI
#define KEY0_EXTI_IRQn EXTI9_5_IRQn
#define AD1292_DRDY_Pin GPIO_PIN_0
#define AD1292_DRDY_GPIO_Port GPIOA
#define AD1292_DRDY_EXTI_IRQn EXTI0_IRQn
#define AD1292_CS_Pin GPIO_PIN_1
#define AD1292_CS_GPIO_Port GPIOA
#define AD1292_ST_Pin GPIO_PIN_2
#define AD1292_ST_GPIO_Port GPIOH
#define AD1292_PW_Pin GPIO_PIN_3
#define AD1292_PW_GPIO_Port GPIOH
#define LTDC_Black_Pin GPIO_PIN_13
#define LTDC_Black_GPIO_Port GPIOD
#define LED1_Pin GPIO_PIN_3
#define LED1_GPIO_Port GPIOI
#define LED0_Pin GPIO_PIN_4
#define LED0_GPIO_Port GPIOD
#define IIC_CL_Pin GPIO_PIN_4
#define IIC_CL_GPIO_Port GPIOB
#define IIC_DA_Pin GPIO_PIN_6
#define IIC_DA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
